#  جوا ملف الدوكر-فايل نكتب جميل الديبنسيس الي مشروعي محتاجها عشان يقدر يشغلي المشروع حقي
# وبعد ما تكتب كل الادوات المطلوبه لمشروعك بنروح نشغل الملف حق دوكر جوا حاجه اسمها كونتينر
# اعتبر الكونتينر هو جهاز جديد او سيرفر جديد لسا ما فيه جواه اي شي

# من ناحيه مكونات الدوكر فايل

# اللحين بيحط لي نود جوا الكونتينر حقي
# FROM node:16 ## كتبنا واحد جديد تحت 

#لانشاء ملف جوا الدوكر عشان نحط فيه كامل الادوات المستخدمه
# WORKDIR /app  ## كتبنا واحد جديد تحت 

# هيك معناها انقل كل شي جوا الباكيج وحطه جوا الكونتينر الي هو آآب/ الي بندل عليها بعلامه النقطه
# COPY package.json .   ## كتبنا واحد جديد تحت 

# عشان نسوي تحميل لكل الادوات الي جوا الباكيج
# RUN npm install خلاص نمسح الجزء ونحط الي بعده مكتوب والسبب شرحناه بدروس قدام بتلقى شرحها
# ARG NODE_ENV
# RUN if ["$NODE_ENV" = "production"]; \
#     then npm install --only=production; \
#     else npm install; \
#     fi       
## اللحين هنشيل كل الي كتبناه من السطر ١٨ الي ٢٢ عشان نشترح الطريقه الثانيه
# RUN npm install ## كتبنا واحد جديد تحت 



# بعد ما اسوي رن راح يتم انشاء النود مودول فولدر 

# اللحين نبقي ننسخ كل الملفات الى الكونتينر
# COPY index.js .
#او نقدر نستخدم هذا الكود لنسخ كل شي مره واحده
# COPY . . ## كتبنا واحد جديد تحت 

# هنا نفهم الكونتينر انه على بورت شغال البرنامج
# EXPOSE 4000 ## كتبنا واحد جديد تحت 


# اللحين نشغل الابلكيشن حقنا 
# CMD [ "npm", "run", "start-dev" ] ## كتبنا واحد جديد تحت 


# BEFHLE
# docker build ./Dockerfile  عشان اسوي بييلد ويسوي لنا اميج للدكور فايل نتسخدم الكومت هذا واعطيه اسم الدوكر فايل لو حطيت نفطه بس بدون الاسم كامل
# بالحاله هذي هوا لحاله هيدور الدوكر فايل ويسوي له بلد

# docker build -t express-node-app .  هذا السطر مثل الي فوق واستخدمنا النقطه بدال الاسم ولكن حطيت اسم للبيلد او للاميج الي راح ينشأه الدوكر فايل
# عن طريق الاميج نقدر نسوي رن للكونتينر

# docker image ls  بهذا الكومنت بشوف الاميج الي انا سويته بالامر الي فوق 

# docker run express-node-app هيك احنا بنسوي رن لاميج الي سويناها ولكن الافضل نحط اسمه للكونتينر الي بنشغل فيها الاميج

# docker run --name express-node-app-container express-node-app هنسوي اللحين رن لكونتينر من الاميج الي سويناها 
# ولكن هذي المره راح احط اسم للكونتينر الي بشغل فيه الاميج الي سويته

# docker run --name express-node-app-container -d  express-node-app نفس الي فوق ولكن لم يسوي رن للكونتينر لا تعرض
# لي اللوجزس الي بيطلعن او التيرمنال حق الكونتينر 

# docker attach express-node-app-container  واذا حابب ارجع اللوجز بعد ما خفيتهم اكتب هيك

# docker run --name express-node-app-container -d -p 4000:4000 express-node-app هنا عشان اعمل خط اتصال بين جهازي والكونتينر 
# بالحاله هذي بقدر اشوف الي جوا الكونتينر 

# docker ps يعرض جميع الكونتينرات الشغاله

# docker start <container-NAMES>  تشغيل كونتينر
# docker stop <container-NAMES>  توقيف الكونتينر 
# docker rm <container-NAMES> حذف الكونتينر ولكن بحاله كانت الكونتينر متوقفه
# docker rm <container-NAMES> -f حذف الكونتينر حتي لو كان شغال
# docker kill <container-NAME> نفس الي فوقها
# docker inspect <container-NAME> هيعرض لي كل المعلومات الي خاصه بالكونتينر
# docker network ls تعرض جميع الشبكات
# docker volume ls تعرض جميع الفوليوم
# docker volume rm تمسح فوليوم
# cat > filename هذ معناه تنشي ملف وتدخل لتعديله بنفس الوقت
# bash kevinnn آغلب طرق تعديل الكونتينرز
# ssh -i ./EC2Tresmerge.pem ubuntu@13.49.18.48 to connect to aws Server




 
## اللحين سوال ليش احنا نسخنا كل شي بمشروعنا  عن طريق الامر 
## COPY ..
## طيب ممكن تنحط ملفات انا م بدي اياها فيه طريقه نقدر نستعرض فيها كل الملفات الي انسخت وانحطت جوا الكونتينر
## docker exec -it <Container-name> bash شرح الامر هذا هو 
## انه يا دوكر نفذ بفتح باش على الكونتينر هذا واعطيني منه انتر اكتيف تيرمنال عشان اقدر اتعامل معه
## بعد الامر هذا يدخلنا جوا الكونتينر مثل جهاز الكمبيوتر وبعدها نستعرض كل الملفات الموجوده في الكونتينر عن طريق الامر  
## ls
## هنلاحظ وجود ملفات احنا ما نحتاجهم على سبيل المثال
## Dockerfile احنا مو محتاجين ننقله معانا جواا الكونتينر لاننا اوريدي احنا جواه
## node_modules برضو هذا مو محتاجين ننقله معانا لانه لما اسوي ان بي ام انستوول راح ينزله لي
## package-lock.json نفس الشي الملف هذا ما راح ينزل لما اسوي ان بي ام انستوول
## فعشان نحل مشكله نقل الملفات الي مو محتاجينها الى الكونتينر راح نسوي ملف اسمه
## .dockerignore بنحط فيه جميع الحاجات الي مو حابين الدوكر ياخذها معه وهو بسوي البيلد او بسوي رن للكونتينر 
## cat <file-name> ملاحظه اذا كنت حابب اعدل على ملف مباشره بالتيرمنال الي فتحته بكتب 

## لو بدي افتح ملف مباشره بدون ما ادخل كاتيرمنال وبعدها افتح الملف بهذي الطريقه
## docker exec ac9 cat /app/package.json هيك بستعرض ملف مباشره بدون الدخول للتيرمنال 

## COPY  package.json . السؤال الثاني احنا ليش كتبنا 
## COPY .. مع انه كنا كاتبين تحت نسخ كل شي 
## قبل ما اكتب الجواب اريد اوضح انه لما اسوي بيلد لاميج وكانت بعض الملفات ما صار عليها تعديل
## CACHEDراح ينطها ويكتب جنبها 
## package.json الجواب هو انه لما اجي ابيلد الاميج وما كنا فيه تغير بملف 
## RUN npm installراح ينط خطوه 
## COPY  package.json . ام لو ما كنا كاتبين 
## RUN npm install راح ينفذ الامر هذا حتى لو ما كان فيه تغير 

## docker logs <container-name> عشان استعرض اللوجز حقت كونتينر محدد

## معلومه اذا غيرت اي شي  داخل ملفات الابلكيشن لازم تسوي بيلد جديده عشان تظهر التغييرات ولكن هذا الشي بسبب تاخير مع كل تعديل
## Docker Hot Reload الحل لهذي المشكله هو 
## وهذا معناه راح اضيف فلاق وانا بشغل الكونتينر عشان يخليه دايم مرتبط بمشروعي واي تغير
## بمشروعي يظهر مباشره بدون ما اسوي بيلد من جديد
## docker run --name express-node-app-container -v /Users/albaraa_1991/Desktop/Docker/docker-kurs:/app -d -p 4000:4000 express-node-app
## -v /Users/albaraa_1991/Desktop/Docker/docker-kurs:/app ما معنى هذا
## -v معناها فوليوم
## انه سوي ربط او سينك بين الدايركتوري حق المشروع وبين الدايروكتري حق الدوكر بالحاله هذي اي تغير
## يصير جوا ملفات المشروع راح تظهر بشكل مباشر
## ولكن ملاحظه مهمه احنا حطينا انه ما ينقل ملف الدوكر لداخل الكونينر لانه حطيناه داخل ملف
## الاجنور ولكن بسسبب انه سوينا سينك للملف صار كل شي موجود بدون حذف
## ملاحظه ثانيه السينك هذا بسوي مشاكل راح نعرفها ونعرف نحلها قدام بالدروس الجايه
## واحد من المشاكل انه لو انشات ملف داخل الكونتينر  راح ينشأه كمان لوكال عندي بسبب السينك ولو مسحت كمان
## اي شي نسويه باحد الطرفين سواء لوكال او الكونتينر راح يسمعو من بعض ويطبق الامر على الطرفين

## Docker Volumes احنا لازم نعرف انه فيه انواع فوليوم كثير 
## -v /Users/albaraa_1991/Desktop/Docker/docker-kurs:/app وهذا الي استخدمناه واحد منهم 
## Bind mount هذا اسم نوع الي استخدمناه وهو ربط اللوكال مع الديركتوري حق الكونتينر 
## ولكن الي بدي اسوي انا انه يسمع من اتجاه واحد فقط، يعني اي تغير لوكال يبان هناك بس العكس لا
## docker run --name express-node-app-container -v /Users/albaraa_1991/Desktop/Docker/docker-kurs:/app:ro -d -p 4000:4000 express-node-app
## :ro  تقريبا مثله ولكن نزود ومعناها ريد اونلي بالشكل هذا راح يسمع من اللوكال للكونتينر اما العكس فلا

##  $(pwd) ونقدر نكتب الامر بالطريقه هذي المختصره ونكتب هيك بدال ما نكتب كامل الباث بنفسنا
## docker run --name express-node-app-container -v $(pwd):/app:ro -d -p 4000:4000 express-node-app

## ولكن ما زال هناك مشكله وهي لو امسح ملف من اللوكال عندي مثلا ملف النود مودول  راح يتعطل كل البرنامج
## فالبتالي فيه طريقه تخليني احتفظ ببعض الملفات في الكونتينر مهما حصل فيها تغير في اللوكال
# Anonymous volumes هنستخدم فوليوم جديد اسمه 
## وبحط جنبها اسامي الملفات الي ما بدي يصير فيها تغير حتى لو تغيرت في اللوكال -v  نفس الامر الي فوق ولكن بكتب مره ثانيه 
## docker run --name express-node-app-container -v $(pwd):/app:ro -v <filesName> -d -p 4000:4000 express-node-app
## مثال كامل 
##docker run --name express-node-app-container -v $(pwd):/app:ro -v /app/node_modules -d -p 4000:4000 express-node-app

##  فيه حل ثالث سريع وسهل لحل وهو من الاساس لما اسوي بايند ما اسويه لكل اللوكال الي 
## ولكن فقط لملفات المشروع المهمه ولهذا بنحطها داخل ملف اسمه سورس عشان نفصله 
## Anonymous volumes بالتالي ما راح احتاج ال 
## وراح احدد البايند فقط من ملف السورس لوكال الى ملف السورس في الكونتينر 
## docker run --name express-node-app-container -v $(pwd)/src:/app/src:ro -d -p 4000:4000 express-node-app

## اليوم بنبدا بالدوكر كومبوز التكمله بتكون هناك




## الحين بنعيد صياغه الدوكر فايل عشان اسويه لاكثر من ستيييج

FROM node:16 as base


FROM base as development
WORKDIR /app  
COPY package.json .   
RUN npm install 
COPY . . 
EXPOSE 4000 
CMD [ "npm", "run", "start-dev" ] 

FROM base as production
WORKDIR /app  
COPY package.json .   
RUN npm install  --only=production
COPY . . 
EXPOSE 4000 
CMD [ "npm", "start" ] 





## Docker Orchestration هذا القسم يشرح اوركاستريشن
## نستخدمها فوق دوكر تعطينا ميزات اضافيه ما بقدر دوكر لحاله يسويها Manegment layer  هي طبقه  
##  هتساعدك في الاشياء هذي
## Deploy:
## Scaling:
## Networking:
## Errors:
## Updates:
## Swarm آو نستخدم حاجه موجوده جوا دوكر اسمها Kubernetes اما عن طريق  Docker Orchestration وعشان تستخدم ال
## بكون جوا دوكر كديفولت ولكن غير مفعل، عشان تشوف مفعل او لا نكتب الامر Swarm طبعا 
## docker info راح تـظهر كل معلومات الدوكر الي عندك ومن ضمنهم معلومات سوارم
## وعشان نفعل سوارم نكتب 
## docker swarm init
## Swarm النود هي الوحده الاساسيه ل   Node لما تبدا تستخدم دوكر سوارم راح تبدا تنشئ عندك حاجه اسمها ال
##  هي المكان وكانه السيرفر حقي الي بشغل الكونتينر فيه Node 
## والفرق بينهم هو Worker Node والنوع الثاني اسمه  Manager Node وفيه منها انواع النود هذي الاول اسمه
## Manager Node مسؤؤله عن اداره الوركر نودز الي موجودات  عندي وهي الي بكون فيها اللوجيك  
## Worker Node و Manager Node ملاحظه مهمه انت ممكن تكتفي بنود واحده وهي بتكون بنفس الوقت  
## هو شبيه بالدوكر كومبوز فايل حقنا بحدد جواه  Stack وبعدها راح اروح انا انشئ حاجه اسمها ال
##  Worker Node السيرفيسس الي بدي اشغلها في 
## docker swarm init مجرد ما اكتب الامر هذا وافعل سوارم 
## Worker Node و Manager Node مجود ما افعلها راح يكتب رساله انه فعلها وانشئ نود رئيسيه هي بتكون ال
## وعشان استخدم دوكر سوارم تكون بهذي الطريقه
## docker service اكتب سيرفيس وجنب جنب السيرفس الامر الي بدي اياه
## هذي بعض الاوامر الي هنستخدمهم مع سوارم
## docker stack
## docker node
