#  جوا ملف الدوكر-فايل نكتب جميل الديبنسيس الي مشروعي محتاجها عشان يقدر يشغلي المشروع حقي
# وبعد ما تكتب كل الادوات المطلوبه لمشروعك بنروح نشغل الملف حق دوكر جوا حاجه اسمها كونتينر
# اعتبر الكونتينر هو جهاز جديد او سيرفر جديد لسا ما فيه جواه اي شي

# من ناحيه مكونات الدوكر فايل

# اللحين بيحط لي نود جوا الكونتينر حقي
FROM node:16

#لانشاء ملف جوا الدوكر عشان نحط فيه كامل الادوات المستخدمه
WORKDIR /app

# هيك معناها انقل كل شي جوا الباكيج وحطي جوا الكونتينر الي هو آآب/ الي بندل عليها بعلامه النقطه
COPY  package.json .

# عشان نسوي تحميل لكل الادوات الي جوا الباكيج
RUN npm install
# بعد ما اسوي رن راح يتم انشاء النود مودول فولدر 

# اللحين نبقي ننسخ كل الملفات الى الكونتينر
# COPY index.js .
#او نقدر نستخدم هذا الكود لنسخ كل شي مره واحده
COPY . .

# هنا نفهم الكونتينر انه على بورت شغال البرنامج
EXPOSE 4000


# اللحين نشغل الابلكيشن حقنا 
CMD [ "npm", "start" ]

# BEFHLE
# docker build ./Dockerfile  عشان اسوي بييلد ويسوي لنا اميج للدكور فايل نتسخدم الكومت هذا واعطيه اسم الدوكر فايل لو حطيت نفطه بس بدون الاسم كامل
# بالحاله هذي هوا لحاله هيدور الدوكر فايل ويسوي له بلد

# docker build -t express-node-app .  هذا السطر مثل الي فوق واستخدمنا النقطه بدال الاسم ولكن حطيت اسم للبيلد او للاميج الي راح ينشأه الدوكر فايل
# عن طريق الاميج نقدر نسوي رن للكونتينر

# docker image ls  بهذا الكومنت بشوف الاميج الي انا سويته بالامر الي فوق 

# docker run express-node-app هيك احنا بنسوي رن لاميج الي سويناها ولكن الافضل نحط اسمه للكونتينر الي بنشغل فيها الاميج

# docker run --name express-node-app-container express-node-app هنسوي اللحين رن لكونتينر من الاميج الي سويناها 
# ولكن هذي المره راح احط اسم للكونتينر الي بشغل فيه الاميج الي سويته

# docker run --name express-node-app-container -d  express-node-app نفس الي فوق ولكن لم يسوي رن للكونتينر لا تعرض
# لي اللوجزس الي بيطلعن او التيرمنال حق الكونتينر 

# docker run --name express-node-app-container -d -p 4000:4000 express-node-app هنا عشان اعمل خط اتصال بين جهازي والكونتينر 
# بالحاله هذي بقدر اشوف الي جوا الكونتينر 

# docker ps يعرض جميع الكونتينرات الشغاله

# docker start <container-NAMES>  تشغيل كونتينر
# docker stop <container-NAMES>  توقيف الكونتينر 
# docker rm <container-NAMES> حذف الكونتينر ولكن بحاله كانت الكونتينر متوقفه
# docker rm <container-NAMES> -f حذف الكونتينر حتي لو كان شغال
# docker kill <container-NAME> نفس الي فوقها



 